content/topics/circle_of_fifths.md
+++
title = "Circle of fifths"
author = ["hermes"]
tags = ["music"]
draft = false
+++

## Overview {#overview}

The circle of fifths is a visual representation of the twelve pitch classes arranged so that each key is a perfect fifth above its clockwise neighbour. It is the central navigational tool in Western tonal music theory: it encodes key signatures, chord relationships, and the tension/resolution axis of harmonic movement. Moving clockwise = sharper keys (adding sharps or removing flats); moving counterclockwise = flatter keys.


## Structure {#structure}

-   12 positions, each a fifth apart (7 semitones clockwise).
-   Major keys on the outer ring; their relative minors on the inner ring.
-   Adjacent keys share all but one note — maximum overlap, minimum friction when modulating.


## The "three neighbours" rule for chord derivation {#the-three-neighbours-rule-for-chord-derivation}

A practical shortcut for deriving the six diatonic chords of any key:

1.  Find the key on the circle.
2.  The key itself plus the two adjacent positions — one clockwise (V, the dominant) and one counterclockwise (IV, the subdominant) — give the three major diatonic chords (IV–I–V).
3.  Each of those major chords has a relative minor sitting 3 semitones below it. Those three relative minors give the minor diatonic chords (ii–vi–iii).
4.  The seventh chord (vii°, diminished) falls a half-step below the root.

**Applied to Ab major / F minor (4-flat key signature):**

-   Circle neighbours: Db (IV) — Ab (I) — Eb (V) → three major chords.
-   Relative minors: Bbm (ii), Fm (vi), Cm (iii).
-   Full diatonic pool: Db, Ab, Eb, Bbm, Fm, Cm, G°.


## Tension and resolution {#tension-and-resolution}

The further a chord sits from the tonic on the circle, the more harmonic tension it creates. Progressions that move clockwise toward the tonic feel like resolution; those that move counterclockwise build anticipation. This principle maps directly onto build/drop dynamics in electronic dance music: tension-building passages use chords far from home; the drop resolves to the tonic.


## Key signatures and harmonic mixing {#key-signatures-and-harmonic-mixing}

Because adjacent keys share nearly all pitches, tracks in adjacent keys on the circle mix smoothly without clashing. This is the theoretical basis for [Harmonic mixing]({{< relref "harmonic_mixing.md" >}}) and the Camelot wheel.

See also: [House music]({{< relref "house_music.md" >}}), [Dorian mode]({{< relref "dorian_mode.md" >}}), [Relative major and minor]({{< relref "relative_major_minor.md" >}}).


## Resources {#resources}

-   2026-06-07 ◦ [House Music: Melody, Bass Lines, and Harmony](~/repos/priv/roam-sources/articles/2026/2026-06-07_house-music-theory-melody-bass-harmony.md) — applied the three-neighbours rule to derive the full diatonic chord pool for Ab major / F minor and showed how each track in a 3-track house set uses a different home chord from the same pool
